#include <iostream>

/*
 * Игра "Камни"
 *
 * 2 игрока (пользователь и компьютер) по очереди берут 1, 2 или 3 камня из кучи.
 * В куче N камней (количество выбирается рандомно).
 * Проигрывает тот, кто взял камень последним.
 *
 * 1. Цикл завершается, когда  проигрывает один из игроков.
 * 2. По окончании игры спрашиваем, будут ли играть снова. Если да - повторяем цикл.
 * 3. Проверка ввода значений.
 * 4. Вывод количества камней перед каждый ходом.
 * 5. На ходе компьютера выводим, сколько камней он берёт.
 *
 */

int main()
{
	std::cout << "Игра \"Камни\"" << std::endl;
	return 0;
}
